trade_exp/src/Documents/ТелефонныйЗвонок/ТелефонныйЗвонок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ТелефонныйЗвонок</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="86df8648-e195-4661-99ee-6052788eb276">
    <name>Входящий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7fc37008-c378-4a70-a9a9-07543c7248a6">
    <name>Тема</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="0dfbe7a9-9c2e-4cbd-ac53-3b547fd73e91">
    <name>АбонентПредставление</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="a22cf6e9-1157-4be5-8d30-aa9bbf2b5e6e">
    <name>Описание</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="67ef6671-f537-46bf-88e6-f5bcf34a17a4">
    <name>АбонентКакСвязаться</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="de778ca7-feaf-4531-80ae-11a534c56928">
    <name>АбонентКонтакт</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6410853e-a17e-44db-b8cc-bfefd7c4d239">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="35133725-9647-42dc-a76a-2e62b2918ac4">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2b6c4184-6d7d-48e5-bd4e-ad31e63398d6">
    <name>Важность</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0a76a84d-e883-477e-8b87-7bf984cdc1cf">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c7b883dc-6c26-4eb5-bc19-7919ad57da27">
    <name>ВзаимодействиеОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="12055ab8-aa14-44ba-a952-006febab54b8">
    <name>ТипОбращения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="470f2f3d-68f1-43aa-b017-17ec1b19cb78">
    <name>НачалоСобытия</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="55d708be-f064-4170-b8fd-d27aa4db0369">
    <name>ОкончаниеСобытия</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="425631ea-c386-43ef-91c7-6e111ae572ff">
    <name>ТипСобытия</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="851e22e5-891f-498d-89f6-d471f241ab76">
    <name>Состояние</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d207962d-87fa-4f4c-a30b-62dcde13017f">
    <name>ВходящееИсходящееСобытие</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
</mdclass:Document>

trade_exp/src/Catalogs/КонтактныеЛицаПартнеров/КонтактныеЛицаПартнеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>КонтактныеЛицаПартнеров</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <owners>Checked</owners>
  </extension>
  <owners>Catalog.Партнеры</owners>
  <attributes extendedConfigurationObject="88f65f23-d220-45ac-bb5e-ad991920d8a1">
    <name>КоммерческаяРассылка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4a84eab8-b976-447a-b70c-f9a1a0fcf29e">
    <name>СервиснаяРассылка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="cd170420-6eb1-4342-ac01-7cc15a278469">
    <name>Пол</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="07a989fe-b7de-44b6-839d-e1cce1d2d423">
    <name>ДатаРождения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="79835be6-c08e-48a0-851c-e3c4da4d8a47">
    <name>ДатаПрекращенияСвязи</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="2aed36e6-44b2-4ff0-a5aa-a3de26037ac0">
    <name>ДополнительнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="29cd916a-e579-4b2a-8c42-645cfd2a9521">
    <name>ДолжностьПоВизитке</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="67d2f639-09f9-487b-aefa-c42471c9026b">
    <name>ДатаРегистрацииСвязи</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="29f8edc3-bc77-4470-9bc6-b58b2924f54d">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="fad70dd9-2de6-4bf6-8dbb-73c8ae806377">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="2f4a3620-e144-45ef-983d-c08853b9c00d">
    <name>РолиКонтактногоЛица</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="3e546e08-a859-49f2-9d04-c9fdb5547183">
      <name>РольКонтактногоЛица</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="65059fcf-d30d-4366-aabc-1736a2a1198c">
    <name>КонтактнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="ed8a7e81-0491-40c9-85ad-25eeaba1fca6">
      <name>НомерТелефона</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>20</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="a2b540da-bf58-4390-a7b2-661526f17d4f">
      <name>АдресЭП</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="89012594-b147-4b78-877f-5aab7931b40e">
      <name>Тип</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="1507bf85-d479-4d4c-b34f-ae3f3fbe92d0">
      <name>Вид</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="b63093be-8b18-45db-919f-2d2f35cdb506">
      <name>Представление</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>500</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="fc28b0c1-636d-4c23-8c21-455cd4bebef5">
      <name>ЗначенияПолей</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="05dd77e7-4fd2-48f4-8640-c93b02b1eb79">
      <name>Страна</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="8f734afc-a408-43bb-93db-935b5f9170e5">
      <name>Регион</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>50</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="67b0ea34-b34b-438c-88b4-ea7000b976a4">
      <name>Город</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>50</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="aea39c26-5e67-4e48-a500-80d0be565914">
      <name>ДоменноеИмяСервера</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="6264c98a-e06e-425e-856e-cdbe9b629f13">
      <name>НомерТелефонаБезКодов</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>20</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="3e9f77f7-1522-4b52-af74-f8de0616bac8">
      <name>ВидДляСписка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="d228be44-cb90-454d-a57c-16fc89dd78ba">
      <name>Значение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

trade_exp/src/CommonForms/ПростыеЗвонки_ДопФорма/Module.bsl
&НаКлиенте 
Перем НужноЗакрыватьФорму; 
&НаКлиенте 
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка) 
	Если НЕ НужноЗакрыватьФорму = Истина Тогда
	    Отказ = Истина; 
		Оповещение = Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект); 
		ПоказатьВопрос(Оповещение, "Вы действительно хотите закрыть окно?", РежимДиалогаВопрос.ДаНет); 
	КонецЕсли; 
КонецПроцедуры 
&НаКлиенте 
Процедура ПередЗакрытиемЗавершение(Результат, ДополнительныеПараметры) Экспорт 
	Если Результат = КодВозвратаДиалога.Да 
		Тогда НужноЗакрыватьФорму = Истина; 
		Закрыть(); 
	Иначе 
		НужноЗакрыватьФорму = Неопределено; 
	КонецЕсли; 
КонецПроцедуры


&НаСервере
Процедура ГотовоНаСервере()
	УстановитьПривилегированныйРежим(Истина);
	Попытка
		НачатьТранзакцию();
		НовоеВзаимодействие = Документы.ТелефонныйЗвонок.СоздатьДокумент();
		СсылкаНового = Документы.ТелефонныйЗвонок.ПолучитьСсылку();
		НовоеВзаимодействие.УстановитьСсылкуНового(СсылкаНового);
		СсылкаНовогоВзаимодействия = НовоеВзаимодействие.ПолучитьСсылкуНового();
		НовоеВзаимодействие.Дата = ТекущаяДата();
		НовоеВзаимодействие.АбонентКонтакт = Клиент;
		НовоеВзаимодействие.АбонентКакСвязаться = СокрЛП(Телефон);
		ПредставлениеАбонента = СокрЛП(КонтактноеЛицо);
		Если ЗначениеЗаполнено(ПредставлениеАбонента) Тогда
			ПредставлениеАбонента = ПредставлениеАбонента + "("+СокрЛП(Клиент)+")";
		Иначе
			ПредставлениеАбонента = СокрЛП(Клиент);
		КонецЕсли;
		НовоеВзаимодействие.АбонентПредставление = ПредставлениеАбонента;
		НовоеВзаимодействие.Входящий = Истина;
		НовоеВзаимодействие.Тема = "Звонок в Call-центр";
		НовоеВзаимодействие.Описание = "Причины звонка: " + ПолучитьПричиныЗвонка();
		НовоеВзаимодействие.Автор = Пользователи.ТекущийПользователь();
		НовоеВзаимодействие.Записать(РежимЗаписиДокумента.Запись);
		
		СтруктураДляЗаписи = ВзаимодействияКлиентСервер.СтруктураРеквизитовВзаимодействияДляЗаписи(, СсылкаНовогоВзаимодействия, , , );
	
		ВзаимодействияВызовСервера.ЗаписьРегистрРеквизитыВзаимодействия(СсылкаНовогоВзаимодействия, СтруктураДляЗаписи);
        ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
	КонецПопытки;
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура Готово(Команда)
	Если Не (Заявка ИЛИ НаличиеЦена ИЛИ АктСверкиОплатаУточнить) Тогда
	Сообщить("Не выбрана ни одна причина звонка!");
Иначе
	ГотовоНаСервере();
	НужноЗакрыватьФорму = Истина;
	ЭтаФорма.Закрыть();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	НужноЗакрыватьФорму = Истина;
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Телефон = Параметры.НомерТелефона;
	Если ЗначениеЗаполнено(Параметры.СтруктураКлиентов) Тогда
		Клиент = Параметры.СтруктураКлиентов.Партнер;
		КонтактноеЛицо = Параметры.СтруктураКлиентов.КонтактноеЛицо;
		Контрагент = Параметры.СтруктураКлиентов.Контрагент;
	КонецЕсли;
	Заголовок = "Входящий звонок от " + Телефон;
КонецПроцедуры

&НаСервере
Функция ПолучитьПричиныЗвонка()
Причины = "";
Причины = ?(Заявка, "Заявка","");
Если ПустаяСтрока(Причины) Тогда
	Если НаличиеЦена Тогда
		Причины = "Наличие, цена";
	Иначе
		Причины = "";
	КонецЕсли;
Иначе
	Если НаличиеЦена Тогда
		Причины = Причины + "; Наличие, цена";
	КонецЕсли;
КонецЕсли;
Если ПустаяСтрока(Причины) Тогда
	Если АктСверкиОплатаУточнить Тогда
		Причины = "Акт-сверки, оплата, уточнить";
	Иначе
		Причины = "";
	КонецЕсли;
Иначе
	Если АктСверкиОплатаУточнить Тогда
		Причины = Причины + "; Акт-сверки, оплата, уточнить";
	КонецЕсли;
КонецЕсли;
Возврат Причины;
КонецФункции

&НаСервере
Процедура ИсправитьТелефонПозжеНаСервере()
	УстановитьПривилегированныйРежим(Истина);
	Попытка
		НоваяЗадача=Задачи.ЗадачаИсполнителя.СоздатьЗадачу();
		НоваяЗадача.Дата = ТекущаяДата();
		НоваяЗадача.Автор = Пользователи.ТекущийПользователь();
		НоваяЗадача.Исполнитель = Пользователи.ТекущийПользователь();
		Новаязадача.Важность = Перечисления.ВариантыВажностиЗадачи.Высокая;
		Новаязадача.СрокИсполнения = ТекущаяДата()+86400;
		Если ЗначениеЗаполнено(КонтактноеЛицо) Тогда
			НоваяЗадача.Наименование = "Изменить номер " + СокрЛП(Телефон) +" у контактного лица " + СокрЛП(КонтактноеЛицо);
			НоваяЗадача.Предмет = КонтактноеЛицо.Ссылка;
		Иначе
			НоваяЗадача.Наименование = "Изменить номер " + СокрЛП(Телефон) +" у клиента " + СокрЛП(Клиент);
		    НоваяЗадача.Предмет = Клиент.Ссылка;
		КонецЕсли;
		НоваяЗадача.Описание = Комментарий;
		НоваяЗадача.Записать();
	Исключение
	КонецПопытки;
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ИсправитьТелефонПозже(Команда)
	Если Не (Заявка ИЛИ НаличиеЦена ИЛИ АктСверкиОплатаУточнить) Тогда
	Сообщить("Не выбрана ни одна причина звонка!");
    Иначе
	ИсправитьТелефонПозжеНаСервере();
	ГотовоНаСервере();
	НужноЗакрыватьФорму = Истина;
	ЭтаФорма.Закрыть();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИсправитьТелефон(Команда)
		
	НомерТелефонаВБуферОбмена();
	
	Если ЗначениеЗаполнено(КонтактноеЛицо) Тогда 
		ПараметрФормыПартнера = Новый Структура("Ключ", КонтактноеЛицо);
		ПолучитьФорму("Справочник.КонтактныеЛицаПартнеров.ФормаОбъекта", ПараметрФормыПартнера).Открыть();
	Иначе
		ПараметрФормыПартнера = Новый Структура("Ключ", Клиент);
		ПолучитьФорму("Справочник.Партнеры.ФормаОбъекта", ПараметрФормыПартнера).Открыть();
	КонецЕсли;

	НужноЗакрыватьФорму = Истина;
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура Клиент1Создание(Элемент, СтандартнаяОбработка)
	НомерТелефонаВБуферОбмена();
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВсе(Команда)
	Заявка = Истина;
	НаличиеЦена=Истина;
	АктСверкиОплатаУточнить = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьВсе(Команда)
	Заявка = Ложь;
	НаличиеЦена=Ложь;
	АктСверкиОплатаУточнить = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура НомерТелефонаВБуферОбмена()
	Телефон_ = Телефон;
	АльтерраОбщегоНазначения.ПривестиКФорматуНомерТелефона(Телефон_);
	HTML = Новый COMОбъект("htmlfile");
	HTML.parentWindow.clipboardData.setData("Text",Телефон_);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПомощникПродаж(Команда)
  ФормаЗаписи = ПолучитьФорму("Обработка.ПомощникПродаж.Форма.Форма");
  СтруктураСвойств = Новый Структура;
  СтруктураСвойств.Вставить("Партнер",Клиент);
  ЗаполнитьЗначенияСвойств(ФормаЗаписи.Объект,СтруктураСвойств,"Партнер",);
  ФормаЗаписи.Открыть();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьЗаказКлиента(Команда)
  ФормаЗаписи = ПолучитьФорму("Документ.ЗаказКлиента.Форма.ФормаДокумента");
  СтруктураСвойств = Новый Структура;
  СтруктураСвойств.Вставить("Партнер",Клиент);
  ЗаполнитьЗначенияСвойств(ФормаЗаписи.Объект,СтруктураСвойств,"Партнер",);
  ФормаЗаписи.Открыть();
КонецПроцедуры

&НаСервере
Функция ПолучитьСоглашение()
КартаЛояльности = АльтерраОбщегоНазначения.ПолучитьКартуЛояльности(Клиент);
СоглашениеКлиента = АльтерраОбщегоНазначения.ПолучитьСоглашениеПоУмолчанию(Клиент,Неопределено,КартаЛояльности);
Возврат СоглашениеКлиента;
КонецФункции

&НаКлиенте
Процедура СкопироватьНомерТелефона(Команда)
	НомерТелефонаВБуферОбмена();
КонецПроцедуры
